lifters-paradise-app/app/controllers/authentication_controller.rb

    def login
        @user = User.find_by_email(params[:email])
---
SELECT  "users".* FROM "users" WHERE "users"."email" IS NULL LIMIT $1  [["LIMIT", 1]]