lifters-paradise-app/app/controllers/workloads_controller.rb

    def index
        @routine = Routine.find(params[:id])
        @workloads = @routine.workloads.all
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "routines".* FROM "routines" LIMIT $1  [["LIMIT", 1]]
SELECT "workloads".* FROM "workloads"

    def show
        @routines = Routine.find(params[:id])
        @workloads = @routines.workloads.find(params[:id])
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT  "workloads".* FROM "workloads" WHERE "workloads"."routine_id" = $1 AND "workloads"."id" = $2 LIMIT $3  [["routine_id", 1], ["id", 1], ["LIMIT", 1]]

    def create
        @workload = Workload.create(workload_params)
        if @workload.save
---
INSERT INTO "workloads" ("weight", "sets", "reps", "rpe", "created_at", "updated_at", "routine_id", "exercise_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["weight", 450], ["sets", 10], ["reps", 5], ["rpe", 2], ["created_at", "2019-06-06 14:28:08.858006"], ["updated_at", "2019-06-06 14:28:08.858006"], ["routine_id", 1], ["exercise_id", 1]]
INSERT INTO "workloads" ("weight", "sets", "reps", "rpe", "created_at", "updated_at", "routine_id", "exercise_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["weight", 500], ["sets", 3], ["reps", 2], ["rpe", 9], ["created_at", "2019-06-06 05:15:10.443213"], ["updated_at", "2019-06-06 05:15:10.443213"], ["routine_id", 1], ["exercise_id", 1]]

    def destroy
        @workload = Workload.find(params[:id])
        @workload.destroy
---
SELECT  "workloads".* FROM "workloads" WHERE "workloads"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
DELETE FROM "workloads" WHERE "workloads"."id" = $1  [["id", 2]]

    def update
        @routine = Routine.find(params[:id])
        @workload = @routine.workloads.find(params[:id])
        @workload.update_attributes(workload_params)
---
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 4], ["LIMIT", 1]]
SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 0], ["LIMIT", 1]]
SELECT  "workloads".* FROM "workloads" WHERE "workloads"."routine_id" = $1 AND "workloads"."id" = $2 LIMIT $3  [["routine_id", 1], ["id", 1], ["LIMIT", 1]]
UPDATE "workloads" SET "weight" = $1, "sets" = $2, "rpe" = $3, "updated_at" = $4 WHERE "workloads"."id" = $5  [["weight", 900], ["sets", 10], ["rpe", 2], ["updated_at", "2019-06-06 14:38:06.874524"], ["id", 1]]