app/controllers/routines_controller.rb

SELECT "routines".* FROM "routines"
---
    def index
        @routines = Routine.all

SELECT  "routines".* FROM "routines" WHERE "routines"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def show
        @routines = Routine.find(params[:id])