app/controllers/workloads_controller.rb

SELECT "workloads".* FROM "workloads"
---
    def index
        @workloads = Workload.all

INSERT INTO "workloads" ("weight", "sets", "reps", "rpe", "created_at", "updated_at", "routine_id", "exercise_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["weight", 23], ["sets", 23], ["reps", 23], ["rpe", 23], ["created_at", "2019-06-07 15:36:31.561876"], ["updated_at", "2019-06-07 15:36:31.561876"], ["routine_id", 1], ["exercise_id", 1]]
INSERT INTO "workloads" ("weight", "sets", "reps", "rpe", "created_at", "updated_at", "routine_id", "exercise_id") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"  [["weight", 450], ["sets", 10], ["reps", 5], ["rpe", 2], ["created_at", "2019-06-06 14:28:08.858006"], ["updated_at", "2019-06-06 14:28:08.858006"], ["routine_id", 1], ["exercise_id", 1]]
---
    def create
        @workload = Workload.create(workload_params)
        if @workload.save

SELECT  "workloads".* FROM "workloads" WHERE "workloads"."id" = $1 LIMIT $2  [["id", 41], ["LIMIT", 1]]
DELETE FROM "workloads" WHERE "workloads"."id" = $1  [["id", 41]]
---
    def destroy
        @workload = Workload.find(params[:id])
        @workload.destroy

SELECT  "workloads".* FROM "workloads" WHERE "workloads"."id" = $1 LIMIT $2  [["id", 36], ["LIMIT", 1]]
UPDATE "workloads" SET "weight" = $1, "sets" = $2, "reps" = $3, "rpe" = $4, "exercise_id" = $5, "updated_at" = $6 WHERE "workloads"."id" = $7  [["weight", 123], ["sets", 3], ["reps", 231], ["rpe", 213], ["exercise_id", 2], ["updated_at", "2019-06-07 17:22:30.791950"], ["id", 14]]
---
    def update
        @workload = Workload.find(params[:id])
        @workload.update(workload_params)